## Plan Result (sbox-01-network)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.network.azurerm_route_table.route_table_appgw
  * module.network.azurerm_subnet_route_table_association.application_gateway_subnet




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.network.azurerm_route_table.route_table_appgw will be created
  + resource "azurerm_route_table" "route_table_appgw" {
      + disable_bgp_route_propagation = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "aks-sbox-appgw-route-table"
      + resource_group_name           = "ss-sbox-network-rg"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
    }

  # module.network.azurerm_subnet_route_table_association.application_gateway_subnet will be created
  + resource "azurerm_subnet_route_table_association" "application_gateway_subnet" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet/subnets/aks-appgw"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":453,"Program":"tfcmt","SHA1":"","Target":"sbox-01-network","Vars":{}} -->